#### Cluster ☸️ `Development`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.cert_manager_cf_issuer[0] will be created
  + resource "kubernetes_manifest" "cert_manager_cf_issuer" {
      + manifest = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-issuer"
            }
          + spec       = {
              + acme = {
                  + email               = "rkwaysltd@gmail.com"
                  + privateKeySecretRef = {
                      + name = "letsencrypt-issuer-account-key"
                    }
                  + server              = "https://acme-v02.api.letsencrypt.org/directory"
                  + solvers             = [
                      + {
                          + dns01    = {
                              + cloudflare = {
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token-secret"
                                    }
                                  + email             = "rkwaysltd@gmail.com"
                                }
                            }
                          + selector = {
                              + dnsZones = [
                                  + "example.com",
                                  + "example.net",
                                ]
                            }
                        },
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "cert-manager.io/v1"
          + kind       = "ClusterIssuer"
          + metadata   = {
              + name = "letsencrypt-issuer"
            }
          + spec       = {
              + acme = {
                  + email               = "rkwaysltd@gmail.com"
                  + preferredChain      = ""
                  + privateKeySecretRef = {
                      + name = "letsencrypt-issuer-account-key"
                    }
                  + server              = "https://acme-v02.api.letsencrypt.org/directory"
                  + solvers             = [
                      + {
                          + dns01    = {
                              + cloudflare = {
                                  + apiTokenSecretRef = {
                                      + key  = "api-token"
                                      + name = "cloudflare-api-token-secret"
                                    }
                                  + email             = "rkwaysltd@gmail.com"
                                }
                            }
                          + selector = {
                              + dnsZones = [
                                  + "example.com",
                                  + "example.net",
                                ]
                            }
                        },
                    ]
                }
            }
        }
    }

  # kubernetes_secret.cert_manager_cf[0] will be created
  + resource "kubernetes_secret" "cert_manager_cf" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_token = (sensitive value)
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*